tests/load/artillery.yaml
config:
  target: http://localhost:8080
  processor: './presentation.cjs'
  phases:
    - duration: 5
      arrivalRate: 5
      name: Load Test
  variables:
    WORKFLOW_ID: 'default'
    BASIC: 'cnAxOkRlZXBlc3RBbmREYXJrZXN0'
scenarios:
  - flow:
    - post:
        url: "/workflows/{{ WORKFLOW_ID }}/exchanges"
        headers:
          authorization: 'Basic {{ BASIC }}'
        capture:
          - json: "$.id"
            as: "exchangeId"
          - json: "$.accessToken"
            as: "accessToken"
          - json: "$.vcapi"
            as: "vcapi"

    - loop:
      - get:
          url: "/workflows/{{ WORKFLOW_ID }}/exchanges/{{ exchangeId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
      - think: 5
      count: 3

    - get:
        url: "{{ vcapi }}/openid/client/authorization/request"
        afterResponse: "getExchangeDetails"

    - post:
        url: "{{ vcapi }}/openid/client/authorization/response"
        beforeRequest: "sendPresentation"
        json:
          presentation_submission: "{{submission}}"
          vp_token: "{{vp_token}}"

    - loop:
      - get:
          url: "/workflows/{{ WORKFLOW_ID }}/exchanges/{{ exchangeId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          capture:
            - json: $.exchange.state
              as: "state"
      - think: 5
      whileTrue: "statePending"